{
    "title": "Smart Blinds 2.0",
    "subtitle": "Smart Blinds that Utilize Smart Phone App or Sun Intensity to Open or Close the Blinds",
    "Overview": "Smart Blinds 2.0 is a refined model based on the origninal Smart Blinds device. The new device uses a 100% custom chip on board design and doesnt rely on prebuilt arduino micro controller. Smart blinds 2.0 also feature a suite of quality of life upgrade to enhance the overall experice for developmentment and implmentation. This innovative updated include reverse polarity protection, on board voltage regulation, FTDI pin programing interface, bluetooth TX & RX jumper pin connection, proper pinout spacing , and upgraded servo capacitor capacity. ",
    "Objective": "After 4 Years of successful and reliable deployment the objective of Smart Blinds 2.0 was to innovate on the existing technology to allow for both a better user experience and a better future development experience. The primary objective was to solve ptifalls found over the course of the deploment to solve in a updated version. These pitfalls included no reverse polarity protection, requiring a separate voltage regulator to be used in series with the devices power cables, no reprogramablility from the main PCB board due to TX and RX communication lines being perminatly used for Bluetooth connection, Inatticuite size of capacitance for 20KG servo motors resulting in infrequent brown outs, and other general issues that did not affect the user experience such as inproper pinout spacing for male pin headers, inconveient device layout on PCB. ",
    "Array": [
        {
            "Components": "2x Servo Motor (20kg), Atmega 328P-PU, HC-05 Bluetooth Module, 10K Photo Resistor, 12v AC DC Power Supply, 220 ohm Ressistor, 10K omh Ressistor, 100NF Capacitor, 1000uf Capacitor, 22pf, 16MHZ Quartz Timing Crystal, Custom PCB ADD THE OTHER DIODE AND VOLTAGE REGULATOR",
            "img": "./images/SmartBlinds/Blinds Schematic .png"
        },
        {
            "Atmega 328P-PU": "DESCRIBE WHAT THE ATMEGA MICROCONTROLLER IS AND HOW IT WORKS, THEN DESCRIBE WHY IT WAS USED FO THIS PROJECT,",
            "img": "./images/SmartBlinds/smart blinds components.jpg"
        },
        {
            "Reverse Polaority Protection and Voltage Regulation": "Smart Blinds 2.0 current iteration uses 2 jumper pins as input for power. Compared to the previous iteration the 2.0 version has labled polarity with a protecting Diode in series. This diode protects the device from a user inproperly plugging in the power cables in reverse order. Compared to the previous inorder to properly power both the servo motors and the micro controller at different voltages the board also contains a voltage regulator and filtering capacitors to allow the servos motors and microcontroller to recive the proper independent voltage inputs.",
            "img": ""
        },
        {
            "Custom Blinds Angle and other Smart Phone App Improvements": "",
            "img": ""
        },

        {
            "General Revisons": "Two prominant general fixes that need to be resolved on the Smart Blinds 2.0 was with pinout spacing and onboard programming. The previous Smart Blinds model had incorrect pinout spaceing and did not have the industry standard pinout spacing. This ment that specific pin's had to be purchased to fit in the provided holes or physical manipulation would be required to fit botht the pins and any connector that plugged into the pins. Smart Blinds 2.0 now supports the industry stardard pinout spacing and allows for seamless solder installation and connector coupling. The original Smart Blinds device used a arduino nano as a all in one solution to control the servo motors. When programming the arduino the TX and RX communication lines are used to communicate with the computer to upload new code. When the Smart Blinds device was powered it woud also power the Bluetooth module that was also attached to the TX and RX communication lines. This ment that in the assembled state the microcontroller could ne be programmed when installed. This would cause delays when developing or testing new code due to the required dissasembly of the device. Now Smart Blinds 2.0 supports jumper capped pinouts for these TX and RX communication lines. This means that when new code is being uploaded to the microcontroller that the jumper pins caps could be removed dissonecting the TX and RX communication from the Bluetooth moduale allowing clean communication witht the programing computer.",
            "img": ""
        },
        
        {
            "Easy EDA PCB Design": "Easy EDA allowed me to create and save a schematic of my electronic circuit. This allows me to view my circuit design electronically clearly and concisely. This also creates a record of my work so if I want to make any revisions I can do so without having to redraw the circuit again. Easy EDA also allowed me to convert my drawn schematic into a PCB File. Once I converted my schematic into a PCB I needed to route the PCB lines to the correct component and create any additional pinouts. Once that is all completed Easy EDA has a printing service that takes your PCB file that you created and make a physical version for your Application",
            "img": "./images/SmartBlinds/Blinds PCB.png"
        }
    ],
    "Conclusion": "",
    "id": 1,
    "mainimgsrc": "./images/SmartBlinds/smart blinds main board.jpg",
    "githublink": ""
}